In [1]:
import pandas as pd

In [4]:
df = pd.read_excel("../xl/course_participants.xlsx")

In [12]:
df.index.name = 'user_id'
df

         user_id   name  age  country  score continent
user_id
0           1001   Mark   55    Italy    4.5    Europe
1           1000   John   33      USA    6.7   America
2           1002    Tim   41      USA    3.9   America
3           1003  Jenny   12  Germany    9.0    Europe

In [14]:
df.reindex([999,1000,1001,1002])

         user_id name  age country  score continent
user_id
999          NaN  NaN  NaN     NaN    NaN       NaN
1000         NaN  NaN  NaN     NaN    NaN       NaN
1001         NaN  NaN  NaN     NaN    NaN       NaN
1002         NaN  NaN  NaN     NaN    NaN       NaN

In [8]:
tf = (df["age"] > 40) & (df["country"] == "USA")
tf

user_id
0    False
1    False
2     True
3    False
dtype: bool

In [10]:
df.loc[tf,:]

         user_id name  age country  score continent
user_id
2           1002  Tim   41     USA    3.9   America

In [11]:
df.loc[df.index>1001,:]

Empty DataFrame
Columns: [user_id, name, age, country, score, continent]
Index: []